{"milestones":[{"date":"RELEASED","title":"Identity & Authentication","description":"Initiate an auth request to redirect the user from your app to the Blockstack browser portal. The user will see the details of the sign-in request and either confirm or deny it. They will then bring their profile information with them."},{"date":"Q2 2017","title":"macOS Browser Portal - Developer Release","description":"The Blockstack Browser Portal is where users manage their identity and storage and access their decentralized applications. With this release, macOS developers will be able to download a desktop application and build applications on the decentralized internet."},{"date":"Q2 2017","title":"Storage","description":"Store new app data with the user and access app data already stored with the user. Data is synced up to the cloud providers and/or self-hosted servers that each user has connected. Access to multiple cloud providers with a single interface means the cloud is turned into a dumb drive."},{"date":"Q3 2017","title":"Linux Browser Portal - Developer Release","description":"The Blockstack Browser Portal is where users manage their identity and storage and access their decentralized applications. With this release, Linux developers will be able to download a desktop application and build applications on the decentralized internet."},{"date":"Q3 2017","title":"Notifications","description":"Create event-driven notifications that can be sent from one user to another user's inbox. Each user gets an API endpoint that allows users to receive short messages. This will enable all multi-player applications, or applications that require users to send and view one another’s data. This feature is required for social networks, messaging apps, document sharing apps and more."},{"date":"Q3 2017","title":"Signing requests","description":"Initiate requests for users to sign files. The user will be redirected from the app to the browser portal, where they will see the details of the request and either confirm or deny it, just like with simple auth requests. Signing requests will enable document signing apps, voting apps, and software distribution apps."},{"date":"Q3 2017","title":"Payment requests","description":"Initiate requests for users to send payments. The user will be redirected from the app to the browser portal, where they will see the details of the request and either confirm or deny it, just like with simple auth requests. Payment requests will enable in-app payments and e-commerce apps."},{"date":"Q3 2017","title":"Storage with Collections","description":"Store user data in collections that can be used across various apps. A collection can be any created around any data type, like photos, videos, notes and invoices. For example, a decentralized home-sharing platform might use the same data as a contractor management system. Two photo sharing apps might borrow from the same user-owned photo library."},{"date":"Q3 2017","title":"Blockstack Core 0.16","description":"The next consensus breaking release of Blockstack Core will add in many protocol improvements, including faster registrations, upgrades to cryptographic functions, a more expressive namespace creation process and more. "},{"date":"Q4 2017","title":"Blockstack iOS Portal","description":"On a truly decentralized internet, developers can build all kinds of apps from web apps to native mobile apps. With the Blockstack iOS portal, developers will be able to build apps on the highest grossing mobile platform for developers."},{"date":"Q4 2017","title":"Blockstack Android Portal","description":"On a truly decentralized internet, developers can build all kinds of apps from web apps to native mobile apps. With the Blockstack Android portal, developers will be able to build apps on the highest grossing mobile platform for developers."},{"date":"Q4 2017","title":"Blockstack on Zcash","description":"Blockstack is a multi-chain system and can operate on any blockchain. It currently operates on the single most secure and stable blockchain—Bitcoin. With this update, we’ll have a blockchain driver for Zcash, allowing to register domains on the Zcash blockchain as well as the Bitcoin blockchain."},{"date":"Q1 2018","title":"Browser Portal - Consumer Release","description":"The Blockstack Browser Portal is where users manage their identity and storage and access their decentralized applications. With this release, regular consumers will be able to download the portal on macOS and Linux."},{"date":"Q1 2018","title":"Identity Attestations","description":"Peer-to-peer attestation will allow users to collect verification from both their peers and trusted authorities. Apps will be able to access user identity verifications and benefit from a greater level of trust."},{"date":"Q1 2018","title":"Browser address bar lookups","description":"Type Blockstack domain names directly into your browser to visit Blockstack apps. Enter Blockstack usernames to view Blockstack profiles. This is a huge step for apps built on Blockstack, as they’ll be accessible outside of the traditional centralized domain name system."},{"date":"Q1 2018","title":"Decentralized Software Distribution","description":"Apps are currently loaded over DNS and HTTPS but they can alternatively be loaded as a bundle and delivered by one of many servers on a peer-to-peer network. This is a much more decentralized way to access the app that will ensure it can't disappear or be unpublished. They’ll live on even after you’re long gone."},{"date":"Q1 2018","title":"Blockstack on Ethereum","description":"Blockstack is a multi-chain system and can operate on any blockchain. It currently operates on the single most secure and stable blockchain—Bitcoin. With this update, we’ll have a blockchain driver for Ethereum, allowing to register domains on the Ethereum blockchain as well as the Bitcoin blockchain."},{"date":"Q2 2018","title":"Fund and name management","description":"Get the ability to programmatically access a subset of user funds and domain names. Send cryptocurrency from one address to another, transfer domain names, update domain name information, and more."},{"date":"2018","title":"Federated Simple Contracts","description":"Smart contracts are powerful but they have massive problems with security and scalability. These problems can be solved by unburdening the entire network of thousands of computers of having to run all of the smart contract logic on chain. Simple contracts do exactly this. A federation of VM's runs the contract and settles monetary transactions on chain with multi-signature accounts. Do everything you can do with smart contracts in a more secure and scalable way.\n"}],"papers":[{"title":"Blockstack: A New Decentralized Internet","publication":"Whitepaper Version 1.0","url":"/whitepaper.pdf","date":"May 2017"},{"title":"Blockstack: A Global Naming and Storage System Secured by Blockchains","publication":"USENIX Annual Technical Conference","url":"/blockstack_usenix16.pdf","date":"June 2016"},{"title":"Bootstrapping Trust in Distributed Systems with Blockchains","publication":"USENIX ;login","url":"/blockstack_login16.pdf","date":"Fall 2016"},{"title":"Extending Existing Blockchains with Virtualchain","publication":"Workshop on Distributed Cryptocurrencies and Consensus Ledgers","url":"/virtualchain_dccl16.pdf","date":"July 2016"}],"videos":[{"title":"Blockstack: A New Internet That Brings Privacy & Property Rights to Cyberspace","urlSlug":"reasontv-a-new-internet-that-brings-privacy-and-property-rights-to-cyberspace","event":"Reason TV","speaker":"Ryan Shea + Muneeb Ali","location":"New York, NY","date":"June 22, 2017","youtubeURL":"https://www.youtube.com/embed/Z4bMFKBRg_k","speakerDeckID":"","image":"/images/resources/talk-reason-tv.jpg"},{"title":"Building a New Decentralized Internet","urlSlug":"consensus-2017-building-a-new-decentralized-internet","event":"Consensus 2017","speaker":"Muneeb Ali + Ryan Shea","location":"New York, NY","date":"May 23, 2017","youtubeURL":"https://www.youtube.com/embed/VZGyS5JobkY","speakerDeckID":"","image":"/images/resources/talk-consensus-2017.jpg"},{"title":"Building an Foundation for Decentralized Identity","event":"Consensus 2017","speaker":"Ryan Shea","location":"New York, NY","date":"May 23, 2017","youtubeURL":"https://www.youtube.com/watch?v=tsPXWixkrFk"},{"title":"Blockchain Powered Decentralized Applications with Blockstack","urlSlug":"nycnode-blockchain-powered-decentralized-applications-with-blockstack","event":"NYCNode","speaker":"Larry Salibra","location":"New York, NY","date":"May 17, 2017","youtubeURL":"https://www.youtube.com/embed/uG06irysjHg","speakerDeckID":"","image":"/images/resources/talk-nycnode.jpg"},{"title":"The Decentralized Internet with Blockstack ","urlSlug":"the-lunduke-hour","event":"The Lunduke Hour","speaker":"Ryan Shea","location":"New York, NY","date":"April 17, 2017","youtubeURL":"https://www.youtube.com/embed/i1fThdPbAEA","speakerDeckID":"","image":"/images/resources/talk-lunduke.jpg"},{"title":"How to Create a Blockchain Identity with Bitcoin (and Ethereum)","urlSlug":"decentralized-apps-and-sovereign-identity","event":"Bitcoin Barcelona","speaker":"Ryan Shea","location":"Barcelona, Spain","date":"February 9, 2017","youtubeURL":"https://www.youtube.com/embed/dCNC2SjqYHc","speakerDeckID":"","image":"/images/resources/talk-itnig.jpg"},{"title":"Welcome to the New Internet","urlSlug":"welcome-to-the-new-internet","event":"TEDxNewYork","speaker":"Muneeb Ali","location":"New York, NY","date":"September 10, 2016","youtubeURL":"https://www.youtube.com/embed/qtOIh93Hvuw?list=PLvaRUGvjpFS2ciobOlOwMeVKDqO7S9ar6","speakerDeckID":"15d4861b7c1842bfbd7add80c99e1cf6","image":"/images/resources/talk-tedxnewyork.png"},{"title":"Innovation & Inclusion w/ Decentralized Apps","urlSlug":"innovation-and-inclusion-with-decentralized-apps","event":"New Context Conference Fall 2016","speaker":"Ryan Shea","location":"San Francisco, CA","date":"November 4, 2016","youtubeURL":"https://www.youtube.com/embed/nknocjo7t00","speakerDeckID":"9a0dca48d9cc4da98e0d1b3094fe4ec1","image":"/images/resources/talk-ncc.png"},{"title":"Decentralized, Server-less Applications with Blockstack","urlSlug":"decentralized-server-less-applications-with-blockstack","event":"All Things Open","speaker":"Ryan Shea","location":"Raleigh, NC","date":"October 27, 2016","youtubeURL":"https://www.youtube.com/embed/WveXpldGGa8","speakerDeckID":"434d4f23ad40417aadfe86643671a5bd","image":"/images/resources/talk-ato.png"},{"title":"Experiences with Building a Global PKI with Blockchains","urlSlug":"experiences-with-building-a-global-pki-with-blockchains","event":"CITP Luncheon Speaker Series","speaker":"Muneeb Ali","location":"Princeton, NJ","date":"March 8, 2016","youtubeURL":"https://www.youtube.com/embed/sBJobY0Aqt0","speakerDeckID":"e7608b083c5d4ef68a199cd4f6b74026","image":"/images/resources/talk-citp.png"}]}