{"404":"---\ntitle: Page Not Found\n---\n\n# Page not found","basic-usage":"---\ntitle: Basic Usage\nnextUrl: /docs/extended-usage\nnextLabel: Extended Usage\nnextDescription: Dig deeper with Blockstack usage. Learn how to transfer names and more.\n---\n\n# Basic Usage\n\n### Lookups\n\nNow, to perform a name lookup, run this command:\n\n```bash\n$ blockstack lookup fredwilson.id\n```\n\nYou should get a response like this:\n\n```json\n{\n  \"data\": {\n    \"$origin\": \"fredwilson.id\",\n    \"$ttl\": \"3600\",\n    \"cname\": [{ \"name\": \"@\", \"alias\": \"https://zk9.s3.amazonaws.com\" }]\n  }\n}\n```\n\n### Cost Estimations\n\n```bash\n$ blockstack fee $(whoami).id\n```\n\nExample response:\n\n```json\n{\n  \"fee\": 0.01624,\n  \"registration_fee\": 0.016,\n  \"transaction_fee\": 0.00024\n}\n```\n\n### Registrations\n\nAfter you get comfortable with looking up names, take the next step and register and manage a name for yourself. Run the following command:\n\n```bash\n$ blockstack register <YOUR FULL NAME>.id\n```\n\nIf the name hasn’t been registered yet, you’ll get a confirmation that your registration is pending:\n\n```json\n{\n  \"message\": \"Name queued up for registration. Please expect a few hours for this process to be completed.\",\n  \"error\": false\n}\n```\n\nAfter a few hours, your registration should go through and you’ll be able to update your DNS records for the name.\n\n### Updates\n\nTo update the data record associated with a name you own, run the `blockstack update` command:\n\n```bash\n$ blockstack update '{ \"cname\": [{\"name\": \"@\", \"alias\": \"https://zk9.s3.amazonaws.com/yeezy.id\"}] }'\n```\n\nExpected response:\n\n```json\n{\n  \"message\": \"Data record updated.\",\n  \"error\": false\n}\n```","blockstack-vs-dns":"---\ntitle: Blockstack vs. Traditional DNS\nnextUrl: /docs/blockstack-vs-namecoin\nnextLabel: Blockstack vs Namecoin\nnextDescription: Learn about how Blockstack DNS differs from Namecoin.\n---\n\n# Blockstack vs. Traditional DNS\n\nWith the Blockstack software, a network of computers collectively maintain a global registry of domain names.\n\nIn this registry, each of the names has an owner, represented by a cryptographic keypair, and is associated with instructions for how browsers and other software should resolve the name.\n\nAs with the traditional domain name system, the Blockstack domain name system allows users to lookup, register, renew, and transfer names, as well as manage name resolution information.\n\nBut, Blockstack DNS differs in a few fundamental ways from traditional DNS.\n\nFirst, while the traditional domain name system is run by an international organization called ICANN, the Blockstack name registry is maintained in a completely decentralized way. It is run by everyone and it is controlled by no one, giving Blockstack DNS incredible and unprecedented technical and sociopolitical resilience.\n\nSecond, while traditional DNS relies on a fragile system of disseminating name resolution information, making it vulnerable to DNS cache poisoning, Blockstack DNS has a powerful mechanism for securely transmitting name resolution information that is 100% accurate.\n\nAnd last, Blockstack DNS and traditional DNS differ in how they associate names with certificates. Traditional DNS has no built-in system for securely associating names with cryptographic keypairs, so instead it relies on a hierarchy of anointed organizations to attest to the ownership of domains. Here, each organization represents a systemic threat to name resolution security. By comparison, in Blockstack DNS every name is automatically associated with a cryptographic keypair, allowing end-users to have trust in the authenticity of information sent by servers associated with the name.\n","blockstack-vs-namecoin":"---\ntitle: Blockstack vs. Namecoin\n---\n\n# Blockstack vs. Namecoin\n\nBlockstack DNS differs from Namecoin DNS in a few fundamental ways.\n\nFirst, they differ in how the domain name system is operated. Namecoin DNS is operated by nodes of a cryptocurrency called Namecoin, which is a fork of Bitcoin that has it's own separate blockchain. Blockstack DNS, meanwhile, is operated by nodes that read data from and write data to an underlying blockchain, which can be any blockchain that they are configured to operate on top of. The logic for operating the domain name system is decoupled from the logic of the underlying blockchain. This allows a Blockstack network to be configured to operate on any Blockchain in particular, and the main Blockstack network is currently operating on the most secure blockchain - the Bitcoin blockchain.\n\nSecond, with Namecoin DNS, routing information is stored directly in the blockchain, which can lead to quite a bit of blockchain bloat. Blockstack DNS, meanwhile, stores only hashes of routing information records in the blockchain, deciding to store the rest in decentralized content-addressable storage units (by default, Blockstack is configured to store data in a DHT). These routing records then can link to other data stored elsewhere, whether that be in a DHT or on a hosted data storage provider like S3. This makes for a much more scalable and cost-efficient design.\n\nThird, with Namecoin DNS, all names are set at the same low price and there are no options for users to create new namespaces and set their own name pricing schemes. This results in rampant squatting and significantly degrades the user experience for anyone trying to register names. Blockstack DNS, meanwhile, has a wide range of options for users to create their own namespaces and set their own name pricing schemes. Namespaces can be created with really cheap names (great for a username namespace) or they can be created with really expensive names (great for a domain namespace resilient to squatting). Name prices can be set to go down with an increase in the number of characters or with the presence of numbers and special characters. And names can be set to expire in a year or they can be set to never expire at all. All these options allow users to design namespaces that encourage registration of names that users want and are willing to pay for, while dis-incentivizing the mass registration of names by squatters. All this leads to a superior user experience for everyone involved.\n\nLast, Blockstack DNS has support for a bunch of really powerful features that Namecoin DNS simply does not. This includes support for multi-party ownership of names, support for light nodes (enabling secure lookups by mobile devices and desktop users with limited ability to run their own nodes), and support for creating namespaces with a pre-instantiated list of names (to facilitate migration of a namespace from another DNS system, like ICANN DNS).","extended-usage":"---\ntitle: Extended Usage\nnextUrl: /docs/blockstack-vs-dns\nnextLabel: Blockstack vs Traditional DNS\nnextDescription: Learn about how Blockstack DNS differs from traditional ICANN DNS.\n---\n\n# Extended Usage\n\n### Transfers\n\nTo transfer a name that you own to another address, run the `blockstack transfer` command:\n\n```bash\n$ blockstack transfer <name> <recipient>\n```\n\nExpected response:\n\n```json\n{\n  \"message\": \"Name queued up for transfer.\",\n  \"error\": false\n}\n```\n\n### Renewals\n\nTo renew a name that you own, run the `blockstack renew` command:\n\n```bash\n$ blockstack renew <name>\n```\n\nExpected response:\n\n```json\n{\n  \"message\": \"Name queued up for renewal.\",\n  \"error\": false\n}\n```\n\n### Your Names\n\nTo get a list of the names you own, run the `blockstack names` command:\n\n```bash\n$ blockstack names\n```\n\nExpected response:\n\n```json\n{\n  \"names_owned\": [],\n  \"addresses\": [\n    { \"address\": \"1Jbcrh9Lkwm73jXyxramFukViEtktwq8gt\", \"names\": [] }\n  ]\n}\n```\n\n### Your Balance\n\nTo get your Bitcoin balance that can be used for name registrations, run the `blockstack balance` command:\n\n\n```bash\n$ blockstack balance\n```\n\nExpected response:\n\n```json\n{\n  \"balance\": 0.05,\n  \"addresses\": [\n    { \"address\": \"1EHgqHVpA1tjn6RhaVj8bx6y5NGvBwoMNS\", \"balance\": 0.05 }\n  ]\n}\n```\n\n### Importing\n\nTo import a name into your local name wallet or receive it from another sender, get your address with the `blockstack import` command:\n\n```bash\n$ blockstack import\n```\n\nExpected response:\n\n```json\n{\n  \"address\": \"1Jbcrh9Lkwm73jXyxramFukViEtktwq8gt\"\n}\n```\n\n### Whois Information\n\nTo get various information on a given name, including when it was registered and the address it is owned by, run the `blockstack whois` command:\n\n```bash\n$ blockstack whois fredwilson.id\n```\n\nExample response:\n\n```json\n{\n  \"block_preordered_at\": 374084,\n  \"block_renewed_at\": 374084,\n  \"owner_address\": \"1F2nHEDLRJ39XxAvSxwQhJsaVzvS5RHDRM\",\n  \"owner_public_keys\": [\"0411d88aa37a0eea476a5b63ca4b1cd392ded830865824c27dacef6bde9f9bc53fa13a0926533ef4d20397207e212c2086cbe13db5470fd29616abd35326d33090\"],\n  \"owner_script\": \"76a91499e7f97f5d2c77b4f32b4ed9ae0f0385c45aa5c788ac\",\n  \"preorder_transaction_id\": \"2986ec31ec957692d7f5bc58a3b02d2ac2d1a60039e9163365fc954ff51aeb5a\",\n  \"registered\": true\n}\n```\n\n### Blockstack Server Updates\n\nTo update the blockstack server that your command line is connecting to, use the `blockstack config` command:\n\n```bash\n$ blockstack config --server=server.blockstack.org --port=6264\n```\n\nExpected response:\n\n```json\n{\n  \"message\": \"Configuration settings updated.\",\n  \"error\": false\n}\n```","index":"# Intro to Blockstack\n\nBlockstack is decentralized DNS.\n\nWhen you run a Blockstack node, you join a network of computers in maintaining a global registry of domain names that is more secure by design than traditional DNS and much more resilient to outside tampering and control.\n\nBlockstack gives you:\n\n- name lookups on a decentralized naming system\n- name registrations and transfers without centralized registrars\n- automatic binding of names to owning cryptographic keypairs\n- automatic cache invalidation\n- immunity to DNS cache poisoning\n- robust certificate pinning capabilities\n- resistence to censorship of name registration and resolution\n\nTo get started with Blockstack, read the installation and usage guides below.","installation":"---\ntitle: Installation\nnextUrl: /docs/basic-usage\nnextLabel: Basic Usage\nnextDescription: Explore the basic usage of Blockstack, including looking up and registering names.\n---\n\n# Installation\n\nThe quickest way to get started with Blockstack and get a glimpse of what it can do is to download the command line interface and perform a name lookup.\n\nInstalling the Blockstack command line interface is simple if you have pip. Just run the following command in your console:\n\n```bash\n$ pip install blockstack\n```\n\n### Alternative Installations\n\n#### Mac Users\n\nIf you're a mac user and would like an alternative to installing through pip, you can also install Blockstack with brew, as seen below.\n\n```bash\n$ brew install blockstack\n```\n\n#### Linux Users\n\nIf you're a linux user and would like an alternative to installing through pip, you can also install via apt-get.\n\nFirst, though, you'll need to add packages.blockstack.org to your sources list to tell apt-get where to get the blockstack package:\n\n```bash\n$ wget -O - http://packages.blockstack.org/jude@onename.com.gpg.key | sudo apt-key add -\n$ sudo -- sh -c 'echo \"deb http://packages.blockstack.org jessie main\" >> /etc/hosts'\n```\n\nNow, you may move on to installing blockstack via apt-get:\n\n```\n$ sudo apt-get update && sudo apt-get install blockstack\n```\n\nAfter your done installing blockstack, you should be ready to check out the usage section and give it a spin.\n"}